{
  "schedule": {
    "version": "1.1",
    "conference": {
      "acronym": "hd",
      "title": "DjangoCon Europe 2018",
      "start": "2018-05-23",
      "end": "2018-05-27",
      "daysCount": 5,
      "timeslot_duration": "00:05",
      "days": [
        {
          "index": 1,
          "date": "2018-05-23",
          "day_start": "2018-05-23T00:00:00+02:00",
          "day_end": "2018-05-24T00:00:00+02:00",
          "rooms": {
            "🏰": [
              {
                "id": 138,
                "guid": "ce3cc2e2-110c-54fe-a04e-476cfa0c050f",
                "logo": null,
                "date": "2018-05-21T08:00:00+02:00",
                "start": "08:00",
                "duration": "01:00",
                "room": "🏰",
                "slug": "GF7HPP",
                "url": "https://2018.djangocontent.eu/hd/talk/GF7HPP",
                "title": "",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 135,
                "guid": "4b9c312b-de9f-5934-974c-e09f70998899",
                "logo": null,
                "date": "2018-05-23T09:00:00+02:00",
                "start": "09:00",
                "duration": "00:20",
                "room": "🏰",
                "slug": "VYAMPG",
                "url": "https://2018.djangocontent.eu/hd/talk/VYAMPG",
                "title": "Guten Morgen",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Welcome to DjangoCon Europe 2018!",
                "description": "Welcome to DjangoCon Europe 2018!",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 2,
                    "name": "Raphael Michel",
                    "biography": "",
                    "answers": []
                  },
                  {
                    "id": 1,
                    "name": "Tobias Kunze",
                    "biography": "A biography",
                    "answers": []
                  },
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 134,
                "guid": "50c2e0a9-ba96-57bf-9f35-73782b2548d9",
                "logo": null,
                "date": "2018-05-23T09:20:00+02:00",
                "start": "09:20",
                "duration": "00:50",
                "room": "🏰",
                "slug": "3W7EHE",
                "url": "https://2018.djangocontent.eu/hd/talk/3W7EHE",
                "title": "Keynote: Writing Code? Pfft... Evolve it Instead!",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "We’re heading into a future of delivery drones, driverless cars and 3D-printed “hoverboards” …\r\n\r\nWith machines now able to perform many tasks better than humans, some people are going to be out of a job.\r\n\r\nBut not software developers, right?! Could a computer generate the code you currently write for a living?\r\n\r\nIn this talk, we’ll take a look at how technology is changing the work that people do, and think about the implications of that for our society. We'll then take a look at one of the many biologically inspired approaches to AI - Genetic Algorithms, and how they can be used to generate code given a description of the function that that code should perform, rather than having a software developer write it.\r\n\r\nSpoiler - you’re probably not out of a job, yet…",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 105,
                    "name": "Emma Gordon",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 113,
                "guid": "f2c3b29f-d6d1-5196-ba0d-c094e805ce04",
                "logo": null,
                "date": "2018-05-23T10:10:00+02:00",
                "start": "10:10",
                "duration": "00:30",
                "room": "🏰",
                "slug": "WQTT7A",
                "url": "https://2018.djangocontent.eu/hd/talk/WQTT7A",
                "title": "A different Form of navigation",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Web tooling for data analysis requires, at its heart, a way to select the data a user want's to analyze. This talk shows how you can use forms to pass data among pages, retain the selected form elements through the request/response cycle and build web interfaces that utilize forms while looking like simple link elements. I will also show how I use my [django-modelqueryform](https://django-modelqueryform.readthedocs.io/en/latest/) package to facilitate an advanced user-centric data filtering interface.",
                "description": "Data analysis and visualization tools are different than many applications we build with django. They are not simple CRUD apps, and different users often want to use vastly different data subsets for their analysis. \r\n\r\n- The talk will start with a quick demo of such an application to give context. \r\n- Overview of the functionality provided by [django-modelqueryform](https://django-modelqueryform.readthedocs.io/en/latest/\r\n- Building widgets that encapsulate an instance of the form\r\n- Coding required to maintain the form context through the request/response cycle so that the data selection is maintained through navigation to different analysis types\r\n- Questions/Comments",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 89,
                    "name": "Chaim Kirby",
                    "biography": "15 year software dev working primarily with django since 2011. \r\nMy career has primarily centered on the intersection of medical research and software, including automated reporting of mandated reportable disease based on EMR data, a novel disease-outbreak surveillance system, diabetes research software utilizing social networking, clinical patient care communication and workflow tools, an international disease research registry, and fMRI analysis and interpretation tool.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 61,
                "guid": "635aa265-555f-5794-b641-916f7ac41a48",
                "logo": null,
                "date": "2018-05-23T11:15:00+02:00",
                "start": "11:15",
                "duration": "00:30",
                "room": "🏰",
                "slug": "UVZSRW",
                "url": "https://2018.djangocontent.eu/hd/talk/UVZSRW",
                "title": "It's not a bug, it's a bias",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Product makers have a biased view of the world, and this translates to biased algorithms.\r\nHow can we take this into account, and create a fairer world though fairer algorithms?",
                "description": "Even though Apple's Siri came out with a built-in response to where to hide a body, it was incapable of pointing a user to an abortion clinic.\r\nHow did an Artificial Assistant get iffy about abortion?\r\nAnd how can I stop my own biases from seeping into the products and services I create?\r\n\r\nIn this talk, I explore our preconceptions about the nature of algorithms, and how users and makers influence them to model the world according to their perspective.\r\nI conclude the talk by proposing a change of mindset for product designers, to be more aware of our capacity to let our biases infuse our services, and to put in place tools to create more inclusive experiences for our clients.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 48,
                    "name": "Anna-Livia Gomart",
                    "biography": "Anna-Livia is a developper who believes that through elegant interaction design we can enhance decision making. \r\nIn her spare time, she collects office supplies and makes motivational posters for her D&D character.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 65,
                "guid": "c385ad1d-5cfd-55bd-afa1-a453f9e338c3",
                "logo": null,
                "date": "2018-05-23T11:45:00+02:00",
                "start": "11:45",
                "duration": "00:30",
                "room": "🏰",
                "slug": "ACSKMU",
                "url": "https://2018.djangocontent.eu/hd/talk/ACSKMU",
                "title": "Building real time applications with Django",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Since the introduction of Channels, real time web has become much easier to work with in Django: discover how you can easily create yours with Django!",
                "description": "Since the introduction of Channels, real time web has become much easier to work with in Django. It’s now possible to build real time applications with much less effort in managing the idiosyncrasies of the async programming and a lot of batteries are included. Starting with a brief introduction to Channels (targeting version 2.0), we will see how to build a real time application, both on the Django and the frontend side and how easy it’s to start experimenting with it. The talk has a very hands-on approach, to allow the attendees to experiment with the proposed solution and approach, and starting immediately building their own real time applications with Django.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 51,
                    "name": "Iacopo Spalletti",
                    "biography": "Founder/CTO @NephilaIT - django CMS core dev - Djangonaut - @DjangoConEurope 2017 organizer. I love python, but I tinker with any piece of technology at hand. I like to build and release things, experiment, achieve spectacular failures and sometimes useful successes.\r\nI like to speak and organizing conferences and meetups.\r\nWhen not coding, you can find me on the stool of the local pub mumbling about yeast and hops.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 117,
                "guid": "272a6c50-7083-5987-bc28-c0c6cbfc2d8f",
                "logo": null,
                "date": "2018-05-23T12:15:00+02:00",
                "start": "12:15",
                "duration": "00:30",
                "room": "🏰",
                "slug": "LEPXRG",
                "url": "https://2018.djangocontent.eu/hd/talk/LEPXRG",
                "title": "Can packaging improve Django deployments?",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "How can packaging Django projects make deployments easier, faster and more reliable?",
                "description": "Deployments of Django projects can be a challenging task. Beside the Python source code itself you usually have to handle a lot of other stuff:\r\n\r\n* Installing Python dependencies\r\n* Shipping JavaScript code and installing it's dependencies\r\n* Compiling SCSS to CSS\r\n* Collecting static files\r\n* Building documentation\r\n* Compiling translations\r\n* …\r\n\r\nAnd of course you want a deployment approach that is independent of a specific hosting solution.\r\n\r\nAlso you have to think about the scalability of your deployment when the number of servers you operate increases.\r\n\r\nThis usually means that `git pull` is not the best way to deal with these tasks.\r\n\r\nSo I will discuss different ways to package your Django project like\r\n\r\n* Wheels\r\n* JavaScript packages\r\n* Operating system packages\r\n* Containers\r\n\r\nSome of these concepts will hopefully help you to make your deployment process easier, faster and more reliable.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 92,
                    "name": "Markus Zapke-Gründemann",
                    "biography": "Open Source software developer using Python, Django and JavaScript. CTO at [PicturePipe](http://www.picturepipe.com/). [Code for Leipzig](https://codefor.de/leipzig/), [Leipzig Python User Group](https://lpug.github.io/) and [Deutscher Django-Verein](https://www.django-verein.de/) member.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 29,
                "guid": "9f66f449-ac25-59d7-b6c8-84c4d50b51d0",
                "logo": null,
                "date": "2018-05-23T14:00:00+02:00",
                "start": "14:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "R9E7WN",
                "url": "https://2018.djangocontent.eu/hd/talk/R9E7WN",
                "title": "Representing Hierarchies in Relational Databases",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "In this talk, I’ll explain the fundamental problem representing deep hierarchies in relational databases. To address this problem, we can use a database design pattern, named Materialized Path Trees.",
                "description": "Many data structures require a representation, where one parent node can have any arbitrary number of children. Inside relational databases, this typically is represented by a foreign key onto its own table. In Django’s ORM, we use ``models.ForeignKey('self', ...)``, to create this kind of recursive relationship.\r\nThe major problem with this kind of representation is, that it doesn’t scale for deep trees. Whenever we have to traverse the tree from a given starting node, our code has to perform one database query per hierarchy level.\r\nTo circumvent this, some database vendors implemented SQL dialects, to fetch a whole subtree with one query. Long time ago, Oracle for instance implemented 'CONNECT BY', which is proprietary and not part of the SQL standard. Nowadays, newer releases of most major database vendors implemented the 'WITH RECURSIVE' clause, which has been added to the SQL-99 standard. This allows us to build recursive queries.\r\n\r\nFortunately there is a clever recipe to represent hierarchies in relational databases using standard SQL techniques, but without the mentioned scaling problem: Materialized Path Trees, discovered by Vadim Tropashko. Django’s ecosystem offers two libraries, which implement this design pattern: **django-mptt** and **django-treebeard**. I also would like to mention **django-tree**, which only works on Postgres, using their SQL extension mentioned before.\r\nIn this talk I’ll explain the design patterns for Materialized Path Trees. Furthermore I’ll show the pros and cons of both libraries.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 25,
                    "name": "Jacob Rief",
                    "biography": "After graduating from the University of Innsbruck in CS and Physics, Jacob worked for different companies as a system architect and software developer, where he built and scaled websites in Perl, PHP and Javascript. After dealing with a lot of unmaintainable and poorly written code, Jacob fell in love with Python and Django and hasn’t looked back since. Jacob is a strong believer in sharing knowledge and maintains a dozen of quite popular OSS project on his GitHub account.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 73,
                "guid": "66a5d858-82d8-5f9c-b252-b97d61b6cf54",
                "logo": null,
                "date": "2018-05-23T14:30:00+02:00",
                "start": "14:30",
                "duration": "00:50",
                "room": "🏰",
                "slug": "UA9KYN",
                "url": "https://2018.djangocontent.eu/hd/talk/UA9KYN",
                "title": "Creating Solid APIs",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Increasingly, our apps are used not by humans but by other apps - via their APIs. Thus it is increasingly important that your APIs are well-designed and easy to consume for other developers.\r\nI will share tips and good practices on authentication, versioning, documentation, response structure, and why it all matters.",
                "description": "Adding a few API endpoints to your application for internal consumption is easy. Creating APIs that other developers will love to use is a much harder problem.\r\nYou'll need to think about solving variety of topics such as versioning, authentication, response structure, documentation and more. There are existing good practices for each of them, but often developers who haven't done a lot of API work aren't familiar with them.\r\n\r\nMy talk will show how to build on top of Django and DRF and find reasonable solutions for those problems.\r\nI will talk about JSON API, OAuth2, and other technologies and show how they fit into the puzzle.\r\nBenefits of standardized response structure, as well as auto-generated documentation will also be discussed.\r\n\r\nI'll introduce OAuth2, discussing when it is a good choice and when not, as well as some trickier parts of it.\r\nNext we'll look at why a standardized response structure such as JSON API makes lives of 3rd-party developers easier. We'll then move on to versioning and how you can change your API without breaking all existing apps. And the talk wouldn't be complete without looking at documenting your APIs and why the docs should be auto-generated.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 56,
                    "name": "Rivo Laks",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 127,
                "guid": "8dee6863-f2ab-5d48-9260-11d017abb870",
                "logo": null,
                "date": "2018-05-23T15:20:00+02:00",
                "start": "15:20",
                "duration": "00:30",
                "room": "🏰",
                "slug": "DGNKVG",
                "url": "https://2018.djangocontent.eu/hd/talk/DGNKVG",
                "title": "Making smarter queries with advanced ORM resources",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Django ORM has lots of resources for making complex database queries and the documentation brings good examples on how to apply each one of them, but understanding how to orchestrate all of those resources on real-life projects may not be so simple. My goal with this talk is to show through examples how to combine some of the QuerySet Methods, Query Expressions and other optimization techniques to make the most of DB resources when processing information inside the code is not an option.",
                "description": "When we start modelling an application, we don’t always know how it’s models will evolve and it may be even more difficult to foresee their behaviour when big amounts of data are stored in their respective tables. With tables getting bigger through the project’s life apparently harmless operations may become impossible to make. Thankfully, databases are already prepared for dealing with large amounts of data and resource consuming operations and Django’s ORM provides solutions for most of them.\r\n\r\nFor this talk I’m going to build an example Django project, populate it’s tables with big enough datasets and formulate complex questions to demand the most on the ORM’s possibilities. For each question I’m writing at least one solution using the resources described in the QueryExpressions section of Django’s Docs to then analyse the SQL generated by it and the pros and cons between operational costs and code complexity.\r\n\r\nThe following topics will be covered:\r\n    - Using F() expressions for filtering, ordering and annotate operations\r\n    - Using Max, Min, Avg with annotations\r\n    - Compare Subquery expressions to queryset equivalents\r\n    - Present the new Window functions for partitioned operations\r\n    - Using Union queries",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 94,
                    "name": "Mariana Bedran Lesche",
                    "biography": "I'm a Python developer with a heart in human sciences. Everything I know about programing I learned from the Python and Free Software communities. My goal now is giving back some of that knowledge and warm welcoming I've been receiving all that time. I'm also a feminist very proud of the resistance and inclusion efforts we've been able to build in our community.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 92,
                "guid": "17362d9b-7b44-5115-be19-cf9378f90a5a",
                "logo": null,
                "date": "2018-05-23T16:30:00+02:00",
                "start": "16:30",
                "duration": "00:30",
                "room": "🏰",
                "slug": "7SKMAB",
                "url": "https://2018.djangocontent.eu/hd/talk/7SKMAB",
                "title": "Accessibility Matters: Creating a Better Web",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Accessibility is an afterthought to many, but to those with issues navigating the web it's very important. We will go over examples of accessibility on the web, short and long term solutions, and talk about why accessibility matters to a variety of users. The audience should leave with the ability to spot some accessibility issues and the knowledge of how to fix them.",
                "description": "Accessibility is a huge topic that is often acknowledged as important...by the people who already care about it. This talk is meant to help the entire audience start thinking about accessibility and realize how easy it is to at least put some accessibility into a site (or avoid adding blatantly inaccessible content).\r\n\r\nTen to fifteen percent of the EU has a disability, according to the EU Labour Force Survey, which is a large potential audience for any site. There are various laws that factor into the amount of web accessibility a country must have, and the consequences a business can face because of that. Accessible web development also tends to lead to better UX and a happier user base. And, another plus: It will save devs time and frustration when they’re working with the code, since good HTML is enforced.\r\n\r\nThis talk will start with a broad introduction to accessibility, how to break different concerns down into categories for consideration, and touch on some laws around web accessibility. The second part will go through examples of good and bad accessibility and what to look out for, as well as ways to improve accessibility (including \"easy wins\" that they could implement quickly to drastically improve their sites). The final section will include resources for finding accessibility standards and also browser extensions and the like for people to check on their own.\r\n\r\nThe audience will be expected to have working knowledge of the internet, webpages, and using webpages.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 73,
                    "name": "Lindsey Dragun",
                    "biography": "Lindsey Dragun (drag-uh n) is a tech evangelist and former full-stack developer, who transitioned into tech after earning an MA in International Peace & Conflict Resolution. They have a passion for accessibility across tech and teaching others how to better improve the usability of their applications. In their spare time, Lindsey plays video games, volunteers with local tech meetups, and will go out of their way to pet a dog.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 145,
                "guid": "c25d9b08-a843-56e9-9846-a905a4269d82",
                "logo": null,
                "date": "2018-05-23T17:00:00+02:00",
                "start": "17:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "FSZNK9",
                "url": "https://2018.djangocontent.eu/hd/talk/FSZNK9",
                "title": "Lightning Talks I",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "-",
                "description": "-",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        }
      ]
    }
  }
}
