{
  "schedule": {
    "version": "1.1",
    "conference": {
      "acronym": "hd",
      "title": "DjangoCon Europe 2018",
      "start": "2018-05-23",
      "end": "2018-05-27",
      "daysCount": 5,
      "timeslot_duration": "00:05",
      "days": [
        {
          "index": 1,
          "date": "2018-05-23",
          "day_start": "2018-05-23T00:00:00+02:00",
          "day_end": "2018-05-24T00:00:00+02:00",
          "rooms": {
            "🏰": [
              {
                "id": 138,
                "guid": "ce3cc2e2-110c-54fe-a04e-476cfa0c050f",
                "logo": null,
                "date": "2018-05-23T08:00:00+02:00",
                "start": "08:00",
                "duration": "01:00",
                "room": "🏰",
                "slug": "GF7HPP",
                "url": "https://2018.djangocontent.eu/hd/talk/GF7HPP",
                "title": "Registration",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 135,
                "guid": "4b9c312b-de9f-5934-974c-e09f70998899",
                "logo": null,
                "date": "2018-05-23T09:00:00+02:00",
                "start": "09:00",
                "duration": "00:20",
                "room": "🏰",
                "slug": "VYAMPG",
                "url": "https://2018.djangocontent.eu/hd/talk/VYAMPG",
                "title": "Guten Morgen",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Welcome to DjangoCon Europe 2018!",
                "description": "Welcome to DjangoCon Europe 2018!",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 2,
                    "name": "Raphael Michel",
                    "biography": "",
                    "answers": []
                  },
                  {
                    "id": 1,
                    "name": "Tobias Kunze",
                    "biography": "A biography",
                    "answers": []
                  },
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 134,
                "guid": "50c2e0a9-ba96-57bf-9f35-73782b2548d9",
                "logo": null,
                "date": "2018-05-23T09:20:00+02:00",
                "start": "09:20",
                "duration": "00:50",
                "room": "🏰",
                "slug": "3W7EHE",
                "url": "https://2018.djangocontent.eu/hd/talk/3W7EHE",
                "title": "Keynote: Writing Code? Pfft... Evolve it Instead!",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "We’re heading into a future of delivery drones, driverless cars and 3D-printed “hoverboards” …\r\n\r\nWith machines now able to perform many tasks better than humans, some people are going to be out of a job.\r\n\r\nBut not software developers, right?! Could a computer generate the code you currently write for a living?\r\n\r\nIn this talk, we’ll take a look at how technology is changing the work that people do, and think about the implications of that for our society. We'll then take a look at one of the many biologically inspired approaches to AI - Genetic Algorithms, and how they can be used to generate code given a description of the function that that code should perform, rather than having a software developer write it.\r\n\r\nSpoiler - you’re probably not out of a job, yet…",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 105,
                    "name": "Emma Gordon",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 113,
                "guid": "f2c3b29f-d6d1-5196-ba0d-c094e805ce04",
                "logo": null,
                "date": "2018-05-23T10:10:00+02:00",
                "start": "10:10",
                "duration": "00:30",
                "room": "🏰",
                "slug": "WQTT7A",
                "url": "https://2018.djangocontent.eu/hd/talk/WQTT7A",
                "title": "A different Form of navigation",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Web tooling for data analysis requires, at its heart, a way to select the data a user want's to analyze. This talk shows how you can use forms to pass data among pages, retain the selected form elements through the request/response cycle and build web interfaces that utilize forms while looking like simple link elements. I will also show how I use my [django-modelqueryform](https://django-modelqueryform.readthedocs.io/en/latest/) package to facilitate an advanced user-centric data filtering interface.",
                "description": "Data analysis and visualization tools are different than many applications we build with django. They are not simple CRUD apps, and different users often want to use vastly different data subsets for their analysis. \r\n\r\n- The talk will start with a quick demo of such an application to give context. \r\n- Overview of the functionality provided by [django-modelqueryform](https://django-modelqueryform.readthedocs.io/en/latest/\r\n- Building widgets that encapsulate an instance of the form\r\n- Coding required to maintain the form context through the request/response cycle so that the data selection is maintained through navigation to different analysis types\r\n- Questions/Comments",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 89,
                    "name": "Chaim Kirby",
                    "biography": "15 year software dev working primarily with django since 2011. \r\nMy career has primarily centered on the intersection of medical research and software, including automated reporting of mandated reportable disease based on EMR data, a novel disease-outbreak surveillance system, diabetes research software utilizing social networking, clinical patient care communication and workflow tools, an international disease research registry, and fMRI analysis and interpretation tool.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 61,
                "guid": "635aa265-555f-5794-b641-916f7ac41a48",
                "logo": null,
                "date": "2018-05-23T11:15:00+02:00",
                "start": "11:15",
                "duration": "00:30",
                "room": "🏰",
                "slug": "UVZSRW",
                "url": "https://2018.djangocontent.eu/hd/talk/UVZSRW",
                "title": "It's not a bug, it's a bias",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Product makers have a biased view of the world, and this translates to biased algorithms.\r\nHow can we take this into account, and create a fairer world though fairer algorithms?",
                "description": "Even though Apple's Siri came out with a built-in response to where to hide a body, it was incapable of pointing a user to an abortion clinic.\r\nHow did an Artificial Assistant get iffy about abortion?\r\nAnd how can I stop my own biases from seeping into the products and services I create?\r\n\r\nIn this talk, I explore our preconceptions about the nature of algorithms, and how users and makers influence them to model the world according to their perspective.\r\nI conclude the talk by proposing a change of mindset for product designers, to be more aware of our capacity to let our biases infuse our services, and to put in place tools to create more inclusive experiences for our clients.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 48,
                    "name": "Anna-Livia Gomart",
                    "biography": "Anna-Livia is a developper who believes that through elegant interaction design we can enhance decision making. \r\nIn her spare time, she collects office supplies and makes motivational posters for her D&D character.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 65,
                "guid": "c385ad1d-5cfd-55bd-afa1-a453f9e338c3",
                "logo": null,
                "date": "2018-05-23T11:45:00+02:00",
                "start": "11:45",
                "duration": "00:30",
                "room": "🏰",
                "slug": "ACSKMU",
                "url": "https://2018.djangocontent.eu/hd/talk/ACSKMU",
                "title": "Building real time applications with Django",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Since the introduction of Channels, real time web has become much easier to work with in Django: discover how you can easily create yours with Django!",
                "description": "Since the introduction of Channels, real time web has become much easier to work with in Django. It’s now possible to build real time applications with much less effort in managing the idiosyncrasies of the async programming and a lot of batteries are included. Starting with a brief introduction to Channels (targeting version 2.0), we will see how to build a real time application, both on the Django and the frontend side and how easy it’s to start experimenting with it. The talk has a very hands-on approach, to allow the attendees to experiment with the proposed solution and approach, and starting immediately building their own real time applications with Django.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 51,
                    "name": "Iacopo Spalletti",
                    "biography": "Founder/CTO @NephilaIT - django CMS core dev - Djangonaut - @DjangoConEurope 2017 organizer. I love python, but I tinker with any piece of technology at hand. I like to build and release things, experiment, achieve spectacular failures and sometimes useful successes.\r\nI like to speak and organizing conferences and meetups.\r\nWhen not coding, you can find me on the stool of the local pub mumbling about yeast and hops.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 117,
                "guid": "272a6c50-7083-5987-bc28-c0c6cbfc2d8f",
                "logo": null,
                "date": "2018-05-23T12:15:00+02:00",
                "start": "12:15",
                "duration": "00:30",
                "room": "🏰",
                "slug": "LEPXRG",
                "url": "https://2018.djangocontent.eu/hd/talk/LEPXRG",
                "title": "Can packaging improve Django deployments?",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "How can packaging Django projects make deployments easier, faster and more reliable?",
                "description": "Deployments of Django projects can be a challenging task. Beside the Python source code itself you usually have to handle a lot of other stuff:\r\n\r\n* Installing Python dependencies\r\n* Shipping JavaScript code and installing it's dependencies\r\n* Compiling SCSS to CSS\r\n* Collecting static files\r\n* Building documentation\r\n* Compiling translations\r\n* …\r\n\r\nAnd of course you want a deployment approach that is independent of a specific hosting solution.\r\n\r\nAlso you have to think about the scalability of your deployment when the number of servers you operate increases.\r\n\r\nThis usually means that `git pull` is not the best way to deal with these tasks.\r\n\r\nSo I will discuss different ways to package your Django project like\r\n\r\n* Wheels\r\n* JavaScript packages\r\n* Operating system packages\r\n* Containers\r\n\r\nSome of these concepts will hopefully help you to make your deployment process easier, faster and more reliable.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 92,
                    "name": "Markus Zapke-Gründemann",
                    "biography": "Open Source software developer using Python, Django and JavaScript. CTO at [PicturePipe](http://www.picturepipe.com/). [Code for Leipzig](https://codefor.de/leipzig/), [Leipzig Python User Group](https://lpug.github.io/) and [Deutscher Django-Verein](https://www.django-verein.de/) member.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 29,
                "guid": "9f66f449-ac25-59d7-b6c8-84c4d50b51d0",
                "logo": null,
                "date": "2018-05-23T14:00:00+02:00",
                "start": "14:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "R9E7WN",
                "url": "https://2018.djangocontent.eu/hd/talk/R9E7WN",
                "title": "Representing Hierarchies in Relational Databases",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "In this talk, I’ll explain the fundamental problem representing deep hierarchies in relational databases. To address this problem, we can use a database design pattern, named Materialized Path Trees.",
                "description": "Many data structures require a representation, where one parent node can have any arbitrary number of children. Inside relational databases, this typically is represented by a foreign key onto its own table. In Django’s ORM, we use ``models.ForeignKey('self', ...)``, to create this kind of recursive relationship.\r\nThe major problem with this kind of representation is, that it doesn’t scale for deep trees. Whenever we have to traverse the tree from a given starting node, our code has to perform one database query per hierarchy level.\r\nTo circumvent this, some database vendors implemented SQL dialects, to fetch a whole subtree with one query. Long time ago, Oracle for instance implemented 'CONNECT BY', which is proprietary and not part of the SQL standard. Nowadays, newer releases of most major database vendors implemented the 'WITH RECURSIVE' clause, which has been added to the SQL-99 standard. This allows us to build recursive queries.\r\n\r\nFortunately there is a clever recipe to represent hierarchies in relational databases using standard SQL techniques, but without the mentioned scaling problem: Materialized Path Trees, discovered by Vadim Tropashko. Django’s ecosystem offers two libraries, which implement this design pattern: **django-mptt** and **django-treebeard**. I also would like to mention **django-tree**, which only works on Postgres, using their SQL extension mentioned before.\r\nIn this talk I’ll explain the design patterns for Materialized Path Trees. Furthermore I’ll show the pros and cons of both libraries.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 25,
                    "name": "Jacob Rief",
                    "biography": "After graduating from the University of Innsbruck in CS and Physics, Jacob worked for different companies as a system architect and software developer, where he built and scaled websites in Perl, PHP and Javascript. After dealing with a lot of unmaintainable and poorly written code, Jacob fell in love with Python and Django and hasn’t looked back since. Jacob is a strong believer in sharing knowledge and maintains a dozen of quite popular OSS project on his GitHub account.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 73,
                "guid": "66a5d858-82d8-5f9c-b252-b97d61b6cf54",
                "logo": null,
                "date": "2018-05-23T14:30:00+02:00",
                "start": "14:30",
                "duration": "00:50",
                "room": "🏰",
                "slug": "UA9KYN",
                "url": "https://2018.djangocontent.eu/hd/talk/UA9KYN",
                "title": "Creating Solid APIs",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Increasingly, our apps are used not by humans but by other apps - via their APIs. Thus it is increasingly important that your APIs are well-designed and easy to consume for other developers.\r\nI will share tips and good practices on authentication, versioning, documentation, response structure, and why it all matters.",
                "description": "Adding a few API endpoints to your application for internal consumption is easy. Creating APIs that other developers will love to use is a much harder problem.\r\nYou'll need to think about solving variety of topics such as versioning, authentication, response structure, documentation and more. There are existing good practices for each of them, but often developers who haven't done a lot of API work aren't familiar with them.\r\n\r\nMy talk will show how to build on top of Django and DRF and find reasonable solutions for those problems.\r\nI will talk about JSON API, OAuth2, and other technologies and show how they fit into the puzzle.\r\nBenefits of standardized response structure, as well as auto-generated documentation will also be discussed.\r\n\r\nI'll introduce OAuth2, discussing when it is a good choice and when not, as well as some trickier parts of it.\r\nNext we'll look at why a standardized response structure such as JSON API makes lives of 3rd-party developers easier. We'll then move on to versioning and how you can change your API without breaking all existing apps. And the talk wouldn't be complete without looking at documenting your APIs and why the docs should be auto-generated.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 56,
                    "name": "Rivo Laks",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 127,
                "guid": "8dee6863-f2ab-5d48-9260-11d017abb870",
                "logo": null,
                "date": "2018-05-23T15:20:00+02:00",
                "start": "15:20",
                "duration": "00:30",
                "room": "🏰",
                "slug": "DGNKVG",
                "url": "https://2018.djangocontent.eu/hd/talk/DGNKVG",
                "title": "Making smarter queries with advanced ORM resources",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Django ORM has lots of resources for making complex database queries and the documentation brings good examples on how to apply each one of them, but understanding how to orchestrate all of those resources on real-life projects may not be so simple. My goal with this talk is to show through examples how to combine some of the QuerySet Methods, Query Expressions and other optimization techniques to make the most of DB resources when processing information inside the code is not an option.",
                "description": "When we start modelling an application, we don’t always know how it’s models will evolve and it may be even more difficult to foresee their behaviour when big amounts of data are stored in their respective tables. With tables getting bigger through the project’s life apparently harmless operations may become impossible to make. Thankfully, databases are already prepared for dealing with large amounts of data and resource consuming operations and Django’s ORM provides solutions for most of them.\r\n\r\nFor this talk I’m going to build an example Django project, populate it’s tables with big enough datasets and formulate complex questions to demand the most on the ORM’s possibilities. For each question I’m writing at least one solution using the resources described in the QueryExpressions section of Django’s Docs to then analyse the SQL generated by it and the pros and cons between operational costs and code complexity.\r\n\r\nThe following topics will be covered:\r\n    - Using F() expressions for filtering, ordering and annotate operations\r\n    - Using Max, Min, Avg with annotations\r\n    - Compare Subquery expressions to queryset equivalents\r\n    - Present the new Window functions for partitioned operations\r\n    - Using Union queries",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 94,
                    "name": "Mariana Bedran Lesche",
                    "biography": "I'm a Python developer with a heart in human sciences. Everything I know about programing I learned from the Python and Free Software communities. My goal now is giving back some of that knowledge and warm welcoming I've been receiving all that time. I'm also a feminist very proud of the resistance and inclusion efforts we've been able to build in our community.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 92,
                "guid": "17362d9b-7b44-5115-be19-cf9378f90a5a",
                "logo": null,
                "date": "2018-05-23T16:30:00+02:00",
                "start": "16:30",
                "duration": "00:30",
                "room": "🏰",
                "slug": "7SKMAB",
                "url": "https://2018.djangocontent.eu/hd/talk/7SKMAB",
                "title": "Accessibility Matters: Creating a Better Web",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Accessibility is an afterthought to many, but to those with issues navigating the web it's very important. We will go over examples of accessibility on the web, short and long term solutions, and talk about why accessibility matters to a variety of users. The audience should leave with the ability to spot some accessibility issues and the knowledge of how to fix them.",
                "description": "Accessibility is a huge topic that is often acknowledged as important...by the people who already care about it. This talk is meant to help the entire audience start thinking about accessibility and realize how easy it is to at least put some accessibility into a site (or avoid adding blatantly inaccessible content).\r\n\r\nTen to fifteen percent of the EU has a disability, according to the EU Labour Force Survey, which is a large potential audience for any site. There are various laws that factor into the amount of web accessibility a country must have, and the consequences a business can face because of that. Accessible web development also tends to lead to better UX and a happier user base. And, another plus: It will save devs time and frustration when they’re working with the code, since good HTML is enforced.\r\n\r\nThis talk will start with a broad introduction to accessibility, how to break different concerns down into categories for consideration, and touch on some laws around web accessibility. The second part will go through examples of good and bad accessibility and what to look out for, as well as ways to improve accessibility (including \"easy wins\" that they could implement quickly to drastically improve their sites). The final section will include resources for finding accessibility standards and also browser extensions and the like for people to check on their own.\r\n\r\nThe audience will be expected to have working knowledge of the internet, webpages, and using webpages.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 73,
                    "name": "Lindsey Dragun",
                    "biography": "Lindsey Dragun (drag-uh n) is a tech evangelist and former full-stack developer, who transitioned into tech after earning an MA in International Peace & Conflict Resolution. They have a passion for accessibility across tech and teaching others how to better improve the usability of their applications. In their spare time, Lindsey plays video games, volunteers with local tech meetups, and will go out of their way to pet a dog.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 145,
                "guid": "c25d9b08-a843-56e9-9846-a905a4269d82",
                "logo": null,
                "date": "2018-05-23T17:00:00+02:00",
                "start": "17:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "FSZNK9",
                "url": "https://2018.djangocontent.eu/hd/talk/FSZNK9",
                "title": "Lightning Talks I",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "-",
                "description": "-",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        },
        {
          "index": 2,
          "date": "2018-05-24",
          "day_start": "2018-05-24T00:00:00+02:00",
          "day_end": "2018-05-25T00:00:00+02:00",
          "rooms": {
            "🏰": [
              {
                "id": 136,
                "guid": "ec35cf84-dd5b-52cf-8954-cb2082cd8c13",
                "logo": null,
                "date": "2018-05-24T09:00:00+02:00",
                "start": "09:00",
                "duration": "00:10",
                "room": "🏰",
                "slug": "LRACDG",
                "url": "https://2018.djangocontent.eu/hd/talk/LRACDG",
                "title": "Guten Morgen",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 2,
                    "name": "Raphael Michel",
                    "biography": "",
                    "answers": []
                  },
                  {
                    "id": 1,
                    "name": "Tobias Kunze",
                    "biography": "A biography",
                    "answers": []
                  },
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 133,
                "guid": "6c8a8eff-c71b-5471-ad8c-681fc5483aa8",
                "logo": null,
                "date": "2018-05-24T09:10:00+02:00",
                "start": "09:10",
                "duration": "00:50",
                "room": "🏰",
                "slug": "XH8EX9",
                "url": "https://2018.djangocontent.eu/hd/talk/XH8EX9",
                "title": "Keynote: 23 Years Without A Proper Job",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Ever wondered about being your own boss? Then this talk is for you. Good experience, bad experience: I’ve had some of both as a startup founder and freelancer in the 23 years after I left my last salaried job. Let me share them with you.",
                "description": "Whether you love your job or hate it, at some time you’ve probably wondered what it would be like to work for your self. \r\n\r\nMaybe you’re working on a sideproject and wonder how you could make some money from it? Or maybe you have the idea for the next Facebook or Uber?\r\n\r\nTo be a coder in today’s world of work is to have amazing opportunities to design the business life you want. You can work remotely; you can write books, or teach, or consult, with anyone anywhere.\r\n\r\nYou can have a crazy idea on Friday and have it running by Monday. Design your architecture to use cloud computing, so your tiny team can scale up your huge ideas.\r\n\r\nOr keep it small, and just earn some extra money with a Wordpress plugin, or a training course.\r\n\r\nIt has been 23 years since I last had a ‘real job’ and a regular income.\r\n\r\nI survived creating and running a company through the madness of the dotcom years. I made money from sideprojects, that I had started just for fun and for learning. I have freelanced without needing to use an agency to find the work.\r\n\r\nListen to my stories and learn from my mistakes and successes.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 108,
                    "name": "Rachel Willmer",
                    "biography": "Rachel has been working at the “bleeding edge” of technology for more\r\nthan 3 decades, as a programmer, network engineer, manager, startup\r\nfounder. She remains insatiably curious about how today’s new technology\r\ngives birth to tomorrow’s new business opportunity.\r\n\r\nShe is currently under contract with the Scottish Government as an\r\nInfrastructure Engineer, but also finds time for Luzme, the ebook search\r\nsite which she developed. Technical interests include Django (of\r\ncourse!), real-time data and process automation.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 106,
                "guid": "5ac8d175-b219-549e-8c0b-415af750a750",
                "logo": null,
                "date": "2018-05-24T10:00:00+02:00",
                "start": "10:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "7BBLND",
                "url": "https://2018.djangocontent.eu/hd/talk/7BBLND",
                "title": "Organizing Conferences For Learners: How we did it in Namibia",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "In this talk you will hear about the importance of organizing conferences for school learners, how you can go about organizing one, what you need to do and what you need to avoid as you prepare the conference, how to engage with school teachers as a software developer, what the results of such conferences could bring out in our children and many more.",
                "description": "The poor quality of the software developers in our community is increasing. On top of other factors, most of our learners are introduced or exposed to computing only in university. This has caused the quality of our software developers to drop. We wanted to change that by introducing programming clubs in high schools and then we decided that why not run a conference for them. That's how this idea came up.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 80,
                    "name": "Jessica Upani",
                    "biography": "Undergraduate student at the University of Namibia. She works part time as a high school teacher. She has done a lot of work locally organizing Python and Django workshops through Python Namibia Society, Django Girls, Women in Computing society.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 13,
                "guid": "3523f8de-05b5-5e01-9d59-d8ca55eb4988",
                "logo": null,
                "date": "2018-05-24T11:00:00+02:00",
                "start": "11:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "D3CTA9",
                "url": "https://2018.djangocontent.eu/hd/talk/D3CTA9",
                "title": "ORM: The Sequel",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "This summer... a story of learning. She came from a different world, and must understand her new surrounds. Follow her on a journey of self discovery as she learns about... the Django ORM, via SQL.",
                "description": "Django tutorials often use the perspective of a complete newcomer to Python and web development, and while they provide a good practical on-ramp for brand new developers, they are often not quite right for developers from other backgrounds.\r\n\r\nThe common backbone of MVC development, no matter the base language, is the database and the language specifically for it's manipulation: Structured Query Language (SQL). But Django hides this behind it's amazing drawcard, the Object Relational Model (ORM).\r\n\r\nBut how can a developer already familiar with SQL get a handle on the ORM?\r\n\r\nThis talk endeavours to introduce the ORM using shared SQL and relational database concepts, showcasing the features the ORM uses to make database querying and manipulation a joy, rather than a burden, to the polyglot developer.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 3,
                    "name": "Katie McLaughlin",
                    "biography": "Katie has worn many different hats over the years. She has been a software developer for many languages, systems administrator for multiple operating systems, and speaker on many different topics.\r\n\r\nWhen she's not changing the world, she enjoys making tapestries, cooking, and seeing just how well various application stacks handle emoji.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 26,
                "guid": "b100c61e-48ed-5b1c-a9b5-c0bf56a39a2f",
                "logo": null,
                "date": "2018-05-24T11:30:00+02:00",
                "start": "11:30",
                "duration": "00:30",
                "room": "🏰",
                "slug": "KG7X9P",
                "url": "https://2018.djangocontent.eu/hd/talk/KG7X9P",
                "title": "Taking Channels Async",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "We take a look at Channels 2.0 and the changes it brings by going fully async, examining not only why the change makes things better, but also how we've managed to bridge between Django's synchronous world and the async world, and what the future might hold for Django and Channels.",
                "description": "The Channels project has taken a major turn with version 2.0, embracing Python's async functionality and building applications around an async event loop rather than worker processes. But why the big change? And what does it mean for Django?\r\n\r\nWe'll look at the progress Channels is making in turning more of the request/response cycle into native async code - how far can we get down the stack before making APIs async becomes hard? Can we make it as far as the ORM? How do we bridge between Django's synchronous world and the async world when we do reach that boundary?\r\n\r\nWe also take a look at how it's changed both Channels consumers, opening up the possibility of mixing async calls in with your synchronous code, and how it's changed what the ASGI spec looks like and what that might mean for adoption.\r\n\r\nAnd, finally, we'll look what's next for Django and Channels, and maybe how it will affect the Python web world as a whole.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 22,
                    "name": "Andrew Godwin",
                    "biography": "Andrew is a member of the Django core team, and has been working with Django since 2007, on projects such as South, Django Migrations, and Channels. He works at Eventbrite as a Senior Software Engineer.\r\n\r\nWhen he's not writing open source or travelling around the world speaking about it, he enjoys flying light aircraft, archery, electronics, and developing games.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 83,
                "guid": "ccec5a72-2adf-5ac0-8ef5-07f4c6ff95b3",
                "logo": null,
                "date": "2018-05-24T12:00:00+02:00",
                "start": "12:00",
                "duration": "00:50",
                "room": "🏰",
                "slug": "MUAVUD",
                "url": "https://2018.djangocontent.eu/hd/talk/MUAVUD",
                "title": "Growing old gracefully: on being a career programmer.",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Software development is often seen as a young person's game. But what if, as you get older, you want to keep at the keyboard? Thoughts from a (now) veteran developer on building your career in software development for the long-haul.",
                "description": "This is a community talk. My favourite topics from DjangoConEU 2017 were the non-technical talks. The most interesting (on-topic) conversations I had were about the non-programming aspects of working in software. I wanted to give a talk on that line. \r\n\r\n_Prima facie_ I'm not the best place person to talk about diversity (white, male, etc), but, having been freelance since 2006, with four young children, and now slightly greying hair, I am in a position to talk about how to build a career in software development for the long-haul. Hiring in tech is massively ageist. I want to discuss strategies to handle that. \r\n\r\nMy target audience is individual programmers (whether freelance or employed) as well as software managers, looking to build **and retain** a team. (The message for managers is simply that they need to facilitate their employees' careers. This seems obvious but it **is** worth bringing out.) \r\n\r\nThe core point of my talk is around the idea that a career is very much a marathon rather than a sprint, and that it needs to be approached in that spirit. (Again, this may seem obvious but it **is** worth bringing out.)\r\n\r\nThere are two aspects of this. The one is **pace**. That to work on software day-in, day-out for 10, 20, 30, 40 years (or more) we need to pace ourselves, to manage our reserves, and to have fun. \r\n\r\nThe other is that there is noting to be scared of. That expertise which now may seem intimidating is, yes, available to us too. That with 5, 10, 15 years of continued effort we too (yes, us) can be as experienced as whomever, in the speciality we choose. \r\n\r\nI bring this out with three points. That we need to: \r\n\r\n* **Be disciplined**: The key point is to keep going. We each need to find patterns that work for us and develop them into habits that we build into a routine. The great thing is it doesn't have to be 100 hour weeks. As long as we keep doing it, whatever we do builds up over time. Despite the impression to the contrary, time is on our side. Which leads to...\r\n\r\n* **Be prolific**: Do lots, and put it out there. This one seems scary. \"I'll never do as much as ...\" — but it's an illusion. Do one thing. Put that out there. Do something else. Repeat. Again, the work builds up over time, and (seemingly) all of a sudden, you're in a position of being the expert. Finally...\r\n\r\n* **Be social**: And I don't necessarily mean Facebook (unless Facebook is your thing). In whatever environment or medium suits you get out there meet people. (Stretch your comfort zones a bit here.) Share what you've done. Relish in what others have done. Be part of the community. Help build the community. \r\n\r\nAll three of these are essential. As you get older — all the more as you get older — they allow you to build a sustainable career writing software.\r\n\r\nThis tale is brought out with stories on finding work, and on choosing clients, and employers, financial planning and job security, on family and free-time, and on the importance self-care. It's part inspiration, part battle-plan.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 65,
                    "name": "Carlton Gibson",
                    "biography": "I'm the new Django Fellow, core-team member on Django REST Framework and maintainer of Django Filter and others. Whilst some play Pokemon Go, I play GitHub. \r\n\r\nHusband and father of four. I like cooking, hats, and philosophy. (Not sure on the order there.)",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 81,
                "guid": "136fe55e-bef6-50f7-99b9-6b465ce649a6",
                "logo": null,
                "date": "2018-05-24T14:00:00+02:00",
                "start": "14:00",
                "duration": "00:50",
                "room": "🏰",
                "slug": "MFVCXU",
                "url": "https://2018.djangocontent.eu/hd/talk/MFVCXU",
                "title": "Protecting Personal Data with Django (because it's the law)",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "A new EU regulation comes into effect in the middle of this conference. Here is an overview of what is required and how you can use Django to comply.",
                "description": "From 25 May 2018, anyone collecting personal data on European Union residents will have to follow a number of new rules, some of which are pretty far-reaching. The new rules are however simple enough to understand, and as professionals, getting on top of things like this is what we're being paid for.\r\n\r\nThe regulation is called \"Regulation (EU) 2016/679\" and is commonly known as the \"General Data Protection Regulation\" or \"GDPR\". It has been around for a couple of years and comes into effect now. The previous regime (95/46/EC) was only an EU Directive, so the exact rules were implemented in the native laws of each EU Member State. The new regulation applies everywhere automatically, so it is a single set of rules for all of Europe, which is a good thing. Not everyone will be responsible for managing compliance, but I think every professional software developer should get to know this regulation.\r\n\r\nIn the first half, I'll provide an overview of the parts of the regulation that are relevant for developers. In the second half, I'll look at the ways of complying using Django: what Django already does for you, how to make Django do more, and also (quickly) what sort of data protecting batteries might be useful Django to include going forward.\r\n\r\nI'll be around for the sprints if anyone is interested in working on this at a framework level.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 63,
                    "name": "Will Hardy",
                    "biography": "Australian Software Engineer with a law degree.\r\n\r\nI've been building sites with Django for around 12 years, freelancing in Berlin. I preferred building software to becoming a lawyer, but was always wondering about a way to make use of the law degree. The EU's new General Data Protection Regulation has now made me slightly more useful.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 42,
                "guid": "16129578-76f6-5464-a54a-9f43b1a55488",
                "logo": null,
                "date": "2018-05-24T14:50:00+02:00",
                "start": "14:50",
                "duration": "00:30",
                "room": "🏰",
                "slug": "JLDKMN",
                "url": "https://2018.djangocontent.eu/hd/talk/JLDKMN",
                "title": "On The Look-Out For Your Data",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Do you have data in the database of your Django project? Do you want to find that needle in the haystack of your data? There are plenty options how you can achieve that. With various levels of complexity, confidence, and reliability. I'll give an insight into what the most common are nowadays.",
                "description": "You're tasked with building a search for the project you're working on. But where do you start? What search implementation are you going to use? There's a sheer unlimited set of ways to implement \"I'm looking for X in Y\" out there. Elasticsearch, LIKE and ILIKE queries, MySQL's Fulltext Search, PostgreSQL's Fulltext Search, Solr, Whoosh, Xapian, to only name a few. I'll be looking at the most common ones and will be showing some basic implementation techniques.\r\n\r\nYou should be familiar with Django in so much as that I'm not talking about how to create or update an object in a database. You should also have an idea of what database transactions are. The talk will feature some code snippets that I will provide in full, afterward.\r\n\r\nThe slides are available on [Speaker Deck](https://speakerdeck.com/markush/on-the-look-out-for-your-data-djangocon-europe-2018).",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 20,
                    "name": "Markus Holtermann",
                    "biography": "Markus is a Django core developer since early 2015 with a particular focus on the migrations framework. He discovered Python and Django in 2010 with ubuntuusers.de. Markus currently lives in Berlin and works as a backend developer at LaterPay GmbH.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 63,
                "guid": "5a5b720d-fc8a-5804-9172-b3571fea972a",
                "logo": null,
                "date": "2018-05-24T15:20:00+02:00",
                "start": "15:20",
                "duration": "00:30",
                "room": "🏰",
                "slug": "WNKWEL",
                "url": "https://2018.djangocontent.eu/hd/talk/WNKWEL",
                "title": "Automated spell-checking in Django projects",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "I'm aiming to show how avoid spelling errors by showing ways to implement automated spell-checking.",
                "description": "Nearly all Django applications have two main textual bodies that users come in touch with: First, any text in the application and its translation, second the documentation. Since both are usually written by humans, they will contain spelling errors.\r\nThis is considered harmful and can from time to time hinder the user trying to understand what to do.\r\nTherefore, an automated spell-checking tool should be a part of any CI-cyle.\r\n\r\nFor spell-checking documentation, I will give a short demonstration on how to use the \"sphinxcontrib-spelling\"-tool written by Doug Hellmann, the problems we had and how we overcame them.\r\nFor spell-checking text in the application and its translations that are usually found in .po-files, I have implemented a small tool called \"potypo\" (name and development in progress).\r\nI will present this tool and show challenges and problems on the way to implementing automated spell checking for .po-files.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 50,
                    "name": "Jakob Schnell",
                    "biography": "maths and computer science student. current habitat: milan. fumbling around with django and web and stuff since two years",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 45,
                "guid": "67424b6c-7035-5ea8-82ad-75ebc257e061",
                "logo": null,
                "date": "2018-05-24T16:30:00+02:00",
                "start": "16:30",
                "duration": "00:30",
                "room": "🏰",
                "slug": "SNF83F",
                "url": "https://2018.djangocontent.eu/hd/talk/SNF83F",
                "title": "Strategies to Edit Production Data",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Editing data in a production database is sometimes necessary. However, mistakes in running these queries can be disastrous. In this talk, you will learn strategies for making edits to a production database with examples from a Python stack that increase safety and auditability.",
                "description": "At some point, we all find ourselves at a SQL prompt making edits to the production database. We know it’s a bad practice and we always intend to put in place safer infrastructure before we need to do it again — what does a better system actually look like?\r\n\r\nThis talk progresses through 5 strategies for teams using a Python stack to do SQL writes against a database, to achieve increasing safety and auditability:\r\n\r\n(1) Develop a process for raw SQL edits (2) Run scripts locally (3) Run scripts on an existing server (4) Use a task runner (5) Build a Script Runner service\r\n\r\nWe’ll talk about the pros and cons of each strategy and help you determine which one is right for your specific needs.\r\n\r\nBy the end of this talk you’ll be ready to start upgrading your infrastructure for making changes to your production database safely!",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 35,
                    "name": "Julie Qiu",
                    "biography": "Julie is an engineering manager at Spring. She has lead projects to improve search performance, personalize the user shopping experience, and ingest real time product updates at scale. She graduated from Yale University with a degree in Cognitive Science and currently lives in New York City.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 23,
                "guid": "a0168486-07a8-53a0-b327-70d937df9794",
                "logo": null,
                "date": "2018-05-24T17:00:00+02:00",
                "start": "17:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "FJH989",
                "url": "https://2018.djangocontent.eu/hd/talk/FJH989",
                "title": "Slow Food Digests Better - or how to maintain a 8.5 year old Python project without getting lost",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "AMO - https://addons.mozilla.org/ was originally written as a PHP web application, ported to Python / Django 1.1 in 2010, more or less maintained over time and only recently got much more traction because of Firefox Quantum and Mozilla's move to WebExtensions.\r\n\r\nThe talk will show our approach to maintaining very old code, handling refactoring, adding new features as well as feature/code removal while slowly upgrading our way to a Python 3 and Django 2.0 ecosystem and why we chose that approach over a rewrite.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 19,
                    "name": "Christopher Grebs",
                    "biography": "Web Engineer at Mozilla working on Add-ons and AMO primarily with Python, Django and JavaScript",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 141,
                "guid": "52179f9c-aa68-534d-9004-b4237c85761a",
                "logo": null,
                "date": "2018-05-24T17:30:00+02:00",
                "start": "17:30",
                "duration": "00:20",
                "room": "🏰",
                "slug": "FKRJSK",
                "url": "https://2018.djangocontent.eu/hd/talk/FKRJSK",
                "title": "Lightning Talks II",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "-",
                "description": "-",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 139,
                "guid": "51dd31d9-1487-5cf6-9a4f-963d0fe6b708",
                "logo": null,
                "date": "2018-05-24T20:30:00+02:00",
                "start": "20:30",
                "duration": "04:00",
                "room": "🏰",
                "slug": "XQLMME",
                "url": "https://2018.djangocontent.eu/hd/talk/XQLMME",
                "title": "Social Event",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        },
        {
          "index": 3,
          "date": "2018-05-25",
          "day_start": "2018-05-25T00:00:00+02:00",
          "day_end": "2018-05-26T00:00:00+02:00",
          "rooms": {
            "🏰": [
              {
                "id": 137,
                "guid": "b8760441-85be-5e9b-9063-cb2e913d1f51",
                "logo": null,
                "date": "2018-05-25T09:00:00+02:00",
                "start": "09:00",
                "duration": "00:10",
                "room": "🏰",
                "slug": "J9KB8X",
                "url": "https://2018.djangocontent.eu/hd/talk/J9KB8X",
                "title": "Guten Morgen",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 2,
                    "name": "Raphael Michel",
                    "biography": "",
                    "answers": []
                  },
                  {
                    "id": 1,
                    "name": "Tobias Kunze",
                    "biography": "A biography",
                    "answers": []
                  },
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 132,
                "guid": "c4f46227-9af7-5180-bba8-1c23e005f12e",
                "logo": null,
                "date": "2018-05-25T09:10:00+02:00",
                "start": "09:10",
                "duration": "00:50",
                "room": "🏰",
                "slug": "CCVCXH",
                "url": "https://2018.djangocontent.eu/hd/talk/CCVCXH",
                "title": "Keynote: The naïve programmer",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 103,
                    "name": "Daniele Procida",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 14,
                "guid": "1bb2c793-0c0a-51da-94d6-82ae8d11d0d9",
                "logo": null,
                "date": "2018-05-25T10:00:00+02:00",
                "start": "10:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "RLZMPK",
                "url": "https://2018.djangocontent.eu/hd/talk/RLZMPK",
                "title": "An Intro to Docker for Djangonauts",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "If you've never used it before, Docker can be a little overwhelming. There is new vocabulary to learn, new commands to memorize, and new files to add to each project. Most resources fall into one of two camps: they teach you the bare bones of Docker but still leave you with too many questions to comfortably try it on your own, or they throw you into the deep end by assuming you're more familiar with Docker than you are.\r\n\r\nIn this talk, you will find that middle ground: a talk that doesn't assume you're familiar with Docker and so keeps everything simple, but leaves you with enough information that you can get started as soon as you leave the room. Together, we will step through the parts of a Dockerfile and learn what they do. Then, I'll introduce you to Docker Compose and explain why using it to run multiple containers is helpful. Finally, you will learn to run commands and execute scripts from the command line using Docker, how to enter a container and why you might need to, and what to do before you go home for the day.",
                "description": "This talk is for Djangonauts who are curious about Docker, need to learn to use it for work or personal projects, or who seek a better understanding of containers in general. Audience members might be beginners to Python/Django or not, but they are definitely beginners to containerizing all the things. \r\n\r\nThe audience should be familiar with basic Python concepts such as variables and running things from the command line. Some basic familiarity with Django would be helpful, as the sample project I will demo is a Django app, but beginner Djangonauts will be able to follow along. \r\n\r\n1. Introduction - Who am I? (1 minute) \r\n2. What is Docker? Why use it? (3 min) \r\n  - Eliminates \"it works on my machine\" problems \r\n  - Never install anything globally ever again \r\n  - Great for working with teams \r\n3. Docker definitions (4 min) \r\n  - Image \r\n  - Container \r\n  - Dockerfile \r\n  - Where do virtual environments fit in? \r\n4. Dockerfile (5 min) \r\n  - Go through parts: Python image, setting environment variables, dealing with requirements.txt, set working directory of /code/, expose port \r\n5. Docker Compose \r\n  - What is Docker Compose? (3 min) \r\n    - Allows you to run more than one container in a Docker application\r\n    - Useful for running multiple services like your web server, database, Redis, etc. in separate containers as part of one Docker application \r\n   - docker-compose.yml (6 min) \r\n    - Version \r\n    - Define services (db and web for this presentation)\r\n    - Explain volumes \r\n    - Run commands from services, like runserver \r\n    - Define dependencies \r\n6. Docker on the Command Line (8 min) \r\n  - docker-compose up\r\n  - manage.py commands (docker-compose run web ./manage.py [command]) \r\n  - running tests (docker-compose run web py.test [or ./runtests.py]) \r\n  - opening a shell (docker-compose run web bash) \r\n  - viewing containers (docker ps) and entering a container (see where the /code/ dir is that we created in the Dockerfile) \r\n  - docker-compose down \r\n7. Q&A (any remaining time)",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 12,
                    "name": "Lacey Williams Henschel",
                    "biography": "Lacey Williams Henschel is a developer with REVSYS and part of the organizing team for DjangoCon US. In the past, she's chaired DjangoCon US, organized several Django Girls workshops, taught courses for Treehouse, and written about accessibility at tech events. Previously, she's spoken at DjangoCon Europe, DjangoCon US, Postgres Open, ACT-W, PyDX, and Django Birthday.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 146,
                "guid": "c9de4bee-db3e-516a-9d1a-ac49c236614f",
                "logo": null,
                "date": "2018-05-25T10:45:00+02:00",
                "start": "10:45",
                "duration": "00:10",
                "room": "🏰",
                "slug": "VJQKCT",
                "url": "https://2018.djangocontent.eu/hd/talk/VJQKCT",
                "title": "Physical Health offering",
                "subtitle": "",
                "track": null,
                "type": "Workshop",
                "language": "en",
                "abstract": "-",
                "description": "-",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 109,
                    "name": "Unnamed user",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 11,
                "guid": "62890ee6-a49a-5f2e-ae9d-1fa9cd9cb44e",
                "logo": null,
                "date": "2018-05-25T11:00:00+02:00",
                "start": "11:00",
                "duration": "00:50",
                "room": "🏰",
                "slug": "3JWDRT",
                "url": "https://2018.djangocontent.eu/hd/talk/3JWDRT",
                "title": "Out of Sight, Out of Mind: Survival tricks and tools for remote developers",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "What to do and what not to do in order to collaborate remotely on Django projects without losing your mind",
                "description": "Remote working and “smart working” is very much in fashion these days, but what does it entail for the daily routing of a distributed development team? We will talk about tools, the disputed use of email, Skype, Slack but more specifically about time management, what you can expect from yourself and from other members of the remote team. Is your company “remote-friendly” or rather “remote-first”? When it’s time to spend a few days in physical proximity with your colleagues? We will share some examples out of the experience of a distributed team actively working with Python and Django on a daily basis, and show how you can make it all work, if you work on it.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 10,
                    "name": "Alessio Bragadini",
                    "biography": "A web developer and Agile practitioner/coach that has worked with remote teams for most of his career. Currently living in Milan and working with a team based in Berlin.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 37,
                "guid": "7b23facb-2220-517b-b467-855b10983849",
                "logo": null,
                "date": "2018-05-25T11:50:00+02:00",
                "start": "11:50",
                "duration": "00:30",
                "room": "🏰",
                "slug": "B83BYU",
                "url": "https://2018.djangocontent.eu/hd/talk/B83BYU",
                "title": "GraphQL in Python and Django",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "In this talk, I’ll talk about GraphQL, a data query language created by Facebook as an alternative to the widely used REST. I’ll list the key differences between the twos and pros and cons of GraphQL over a “traditional” REST API.\r\n\r\nI’ll tell why GraphQL has been created, what problems does it solve and how to create GraphQL APIs with Python with an additional follow up on how to use it with Django, one of the most popular web framework. If we have enough time I’ll touch on advanced topics like authentication, caching, security and real-time.\r\n\r\nTakeaway: the objective of the talk is to have an introduction on GraphQL, understand why and when to use it and, finally, how to use it Python.\r\n\r\nAudience: the talk is for web developers with some experience building web APIs.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 33,
                    "name": "Patrick Arminio",
                    "biography": "Chair @ Python Italia, working as Full Stack Developer @ Stink Studios",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 110,
                "guid": "178e37b7-7508-50e9-b603-ce864723e0db",
                "logo": null,
                "date": "2018-05-25T12:20:00+02:00",
                "start": "12:20",
                "duration": "00:30",
                "room": "🏰",
                "slug": "BVD7SC",
                "url": "https://2018.djangocontent.eu/hd/talk/BVD7SC",
                "title": "Banking with Django - how to not lose your customer's money",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Topic: Banking with Django - how to not lose  your customer's money\r\nAbstract: How Holvi decided to pick Django as part of their core infrastructure. I'll go through both the business reasons for using Django for banking (5-10 minutes), and technical details of how we do reliable distributed software which keeps our and customer's money safe (10-20 minutes).",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 82,
                    "name": "Anssi Kääriäinen",
                    "biography": "Anssi Kääriäinen has been a significant contributor and a Core Developer of Django ORM since 2012. Anssi has over 10 years of experience in systems design and implementation and he is an expert in optimising software to be faster for end users. Anssi holds a Master’s Degree in Computer Science from Aalto University in Helsinki, Finland.  Since 2016 he has worked as the Lead Developer at a Finnish fintech company Holvi. Anssi’s specialty is his capability to do design from both technical and user requirements points of view - he understands what customers want from a functionality point of view and knows how to implement these within the product.  He believes in making reliable and simple software to solve complex problems to the end user. Anssi is a big fan of open source - especially Django and PostgreSQL database system.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 96,
                "guid": "c7bbe110-900b-5bc3-9582-3c1d6fab48ee",
                "logo": null,
                "date": "2018-05-25T14:00:00+02:00",
                "start": "14:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "L89TRE",
                "url": "https://2018.djangocontent.eu/hd/talk/L89TRE",
                "title": "Don't Look Back in Anger: Wildman Whitehouse and the Great Failure of 1858",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "In the 1850s, Edward Orange Wildman Whitehouse was appointed the lead engineer of the first attempt to build a trans-Atlantic telegraph cable. This is a tale of a project gone horribly wrong in the age of magnificent facial hair. Step up to learn the secrets of recovering your project from failure!",
                "description": "In the 1850s, Edward Orange Wildman Whitehouse was appointed the lead engineer of the first attempt to build a trans-Atlantic telegraph cable. With the entire population of two continents waiting for his go-live, their handlebar moustaches aquiver, he demonstrated in fine form just how spectacularly a big project can be a bigger disaster.\r\n\r\nThis is a tale of long-winded rants, spectacular sideburns, and gentlemen scientists behaving badly. It is also a lesson about the importance of honest reflection in technical teamwork. Lilly outlines some of the mistakes made during one of the biggest tech delivery projects in history, and how a constructive view of failure helped to turn it all around. Through the public meltdowns of Wildman Whitehouse you will learn the importance of feedback, how to handle complex tasks gracefully, and the best way to recover from having your pipeline eaten by a whale.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 76,
                    "name": "Lilly Ryan",
                    "biography": "Lilly Ryan is an historian, systems engineer, security analyst, and privacy activist.\r\nShe consults on identity and access management systems, security architecture, and software delivery, gives public lectures on ethics and the security mindset, and provides what she calls “Paranoia as a Service\".\r\nShe is always up for a conversation about greyhounds.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 102,
                "guid": "fb53f8ca-e14c-5534-9f7b-0efe299b1ba5",
                "logo": null,
                "date": "2018-05-25T14:30:00+02:00",
                "start": "14:30",
                "duration": "00:30",
                "room": "🏰",
                "slug": "L3TKUZ",
                "url": "https://2018.djangocontent.eu/hd/talk/L3TKUZ",
                "title": "Want More Women in Tech? Start with Django Girls",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "If your hometown can benefit from a free, friendly environment where women can learn to program, it’s time to bring Django Girls to your city. You’ll learn what it takes to run a successful event while hearing tales from the trenches from a seasoned Django Girls organizer.",
                "description": "Ever heard of Django Girls and thought, “Gee, if only that would come to my city, I’d love to be involved!” Django Girls is a fantastic, free weekend-long workshop that teaches women how to code through a comprehensive, Django-based tutorial. Encouraging more women to strive for programming careers benefits the tech community at large, and spearheading a Django Girls event in your city is a positive, actionable way for you to personally become involved.\r\n\r\n##But I’m a Developer - Not an Event Planner!\r\nSo you’re sold that Django Girls is a great idea, but maybe you’re not confident you can execute on it. You don’t need a degree in event planning to plan a great event - developers specialize in problem solving, and running a workshop involves just that. All it takes is a little passion. And sponsors. And a great venue with impeccable WiFi. And a team full of mentors, volunteers and organizers dedicated willing to follow you into the battlefield… Okay, okay. It’s a lot of hard work, but it’s incredibly rewarding to yourself and your community, and I’m ready to share my years of wisdom to help your event run smoothly.\r\n\r\n##Learn From My Mistakes\r\nFrom avoiding volunteer burnout to preventing mutiny from your attendees because the caterer was a flop, I’ll share my insights on what’s worked and what hasn’t over the past three years - and how I intend to improve upon the past two years to make my next event my best yet. I’ll cover logistics, and how to make the event memorable and enjoyable for everyone involved, including recruiting attendees, mentors, sponsors, and other organizers; how to find a great location; what small details are illogically important; and how to communicate effectively within your role as you transform from developer into a community leader.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 57,
                    "name": "Sara Heins",
                    "biography": "Sara is a self-taught web developer from Kansas City, USA. She currently is the Program Director of Django Girls KC, and is heavily involved in her community's efforts to bring more women into technology. When she's not programming or running a workshop, Sara enjoys learning new things, wandering through the wilderness and attempting to live a sustainable lifestyle.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 68,
                "guid": "7d45b2f8-2a05-5e07-becd-4fb89a15b983",
                "logo": null,
                "date": "2018-05-25T15:00:00+02:00",
                "start": "15:00",
                "duration": "00:30",
                "room": "🏰",
                "slug": "7FCV3R",
                "url": "https://2018.djangocontent.eu/hd/talk/7FCV3R",
                "title": "An ODe to OAuth",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "We all know that remembering passwords is hard, so why not leave it to someone else? In this talk, I would like to introduce how we improved our social authentication system in our Django applications at Prezi with the aid of the Python Social Auth package.",
                "description": "After a long time coming, we at Prezi introduced social authentication using Google mid last year. This seemingly trivial problem soon became a nightmare after we realized that our custom built session management systems completely misalign with the standards of the industry and open source. However, our team did not give up the dream of having a fully scalable and easy-to-maintain component that we can be proud of.\r\n\r\nIn this talk, I would like to present you the war story of how we revamped the social authentication systems at Prezi (whilst becoming open source contributors) using the Python Social Auth package, enabling a significant amount of users to access our services on all platforms.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 53,
                    "name": "Akos Hochrein",
                    "biography": "Akos is a former technical lead and senior software engineer on the BIO team in Prezi. His job involves designing and delivering solutions to millions of users every day, building a successful engineering team and petting all the dogs in the office. In his free time, he is enthusiastic about education and chatbots.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 143,
                "guid": "3dd2e5f3-b549-5f88-a986-f782295b0af3",
                "logo": null,
                "date": "2018-05-25T16:10:00+02:00",
                "start": "16:10",
                "duration": "00:20",
                "room": "🏰",
                "slug": "SVZHUN",
                "url": "https://2018.djangocontent.eu/hd/talk/SVZHUN",
                "title": "Intro to Sprints",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 18,
                "guid": "23fbe7f1-c50f-50f0-b871-2556068bfc66",
                "logo": null,
                "date": "2018-05-25T16:30:00+02:00",
                "start": "16:30",
                "duration": "00:30",
                "room": "🏰",
                "slug": "BWQ8AC",
                "url": "https://2018.djangocontent.eu/hd/talk/BWQ8AC",
                "title": "It's about time",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "Why is dealing with dates and time so difficult? Well, it's because time has a very sordid history. Join us on a deep dive into that history, and how that history affects the data modelling and APIs we use every day.",
                "description": "Here's a fun experiment: Mention timezones within earshot of any experienced programmer. Now wait until the profanity stops.\r\n\r\nHandling dates and time is an incredibly common requirement in computer applications. That's hardly surprising - we all use computers to record when we did old things, track how long things take, and to plan when we're going to do things. So why is dealing with time so difficult?\r\n\r\nWell, it's because time has a very sordid history. What we even think of as time has changed. In this talk, you'll travel through time, and see the impact that two thousand years of history have had on our modern life. You'll be shown how all this wibbly-wobbly, timey-wimey history stuff affects the data modelling and APIs we use on a daily basis.\r\n\r\nThis is going to take... some time.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 16,
                    "name": "Russell Keith-Magee",
                    "biography": "Dr Russell Keith-Magee is a 12 year veteran of the Django core team, and for 5 years, was President of the Django Software Foundation. He's also the founder of the BeeWare project, developing GUI tools to support the development of Python software. He lives in Perth, Western Australia with his wife, two children, and two animals that claim to be cats but have almost no feline properties.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 142,
                "guid": "48e09a34-d21f-5f55-903f-e0cbd667fad4",
                "logo": null,
                "date": "2018-05-25T17:00:00+02:00",
                "start": "17:00",
                "duration": "00:45",
                "room": "🏰",
                "slug": "9PXRBY",
                "url": "https://2018.djangocontent.eu/hd/talk/9PXRBY",
                "title": "Lightning Talks III",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "-",
                "description": "-",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 144,
                "guid": "24c5b7d4-3b73-592f-897e-72acff95d8cf",
                "logo": null,
                "date": "2018-05-25T17:45:00+02:00",
                "start": "17:45",
                "duration": "00:15",
                "room": "🏰",
                "slug": "SSGDKQ",
                "url": "https://2018.djangocontent.eu/hd/talk/SSGDKQ",
                "title": "Auf Wiedersehen",
                "subtitle": "",
                "track": null,
                "type": "Talk",
                "language": "en",
                "abstract": "",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 106,
                    "name": "DjangoCon Europe Crew",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        },
        {
          "index": 4,
          "date": "2018-05-26",
          "day_start": "2018-05-26T00:00:00+02:00",
          "day_end": "2018-05-27T00:00:00+02:00",
          "rooms": {
            "🏰": [
              {
                "id": 79,
                "guid": "4648c4f2-bda3-5235-a8b4-d9c552065cf9",
                "logo": null,
                "date": "2018-05-26T10:15:00+02:00",
                "start": "10:15",
                "duration": "02:00",
                "room": "🏰",
                "slug": "7LV7XW",
                "url": "https://2018.djangocontent.eu/hd/talk/7LV7XW",
                "title": "Test Driven Django (Again!)",
                "subtitle": "",
                "track": null,
                "type": "Workshop",
                "language": "en",
                "abstract": "Django does more to enable test driven development than most other frameworks. We'll look at how we can use Django's TestCase and Python's mocking tools to test a simple project and prove to ourselves that our code does what we think it does.",
                "description": "This workshop is an introduction to some common patterns you can use to write test-first Django applications. I'll introduce the different levels of the testing pyramid and how they relate to TDD for web applications. There will be an introduction to Django's TestCase, mocking and coverage tools.\r\n\r\nWe will build a (tiny) API using Django. This will require testing the models and views, as well as our use of Django's timezone module.\r\n\r\nThe workshop will require some understanding of Python, Django & git, but will be targeted at people the beginner to intermediate range. People will use their own laptop and start a new project from scratch.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 61,
                    "name": "Brenton Cleeland",
                    "biography": "I'm a web developer based out of Melbourne, Australia. Currently a consultant with Thoughtworks.\r\n\r\nI spend my spare time building tiny Django (and Python) apps to automate things that annoy me.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 38,
                "guid": "bdf4c3b6-d16e-552e-9bbe-8bff18ef7150",
                "logo": null,
                "date": "2018-05-26T12:30:00+02:00",
                "start": "12:30",
                "duration": "02:00",
                "room": "🏰",
                "slug": "GZHGM7",
                "url": "https://2018.djangocontent.eu/hd/talk/GZHGM7",
                "title": "Writing pylint plugins for Django",
                "subtitle": "",
                "track": null,
                "type": "Workshop",
                "language": "en",
                "abstract": "Pylint is the most popular Python source code analyzer which looks for programming errors, helps enforce a coding standard and sniffs for some code smells. It is possible to write plugins to add your own checks, for example coding patterns that you have observed inside your software and are generally a bad practice or rules which you would like to enforce inside of a particular project, e.g. class name and inheritance conventions.\r\n\r\nThis workshop will focus on  understanding how a pylint plugin works, how to examine the AST tree of a piece of code and create a minimalistic plugin from scratch.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 9,
                    "name": "Alexander Todorov",
                    "biography": "Alex is an open source Quality Assurance engineer with over 11 years background in Linux and Python. He's the second most active contributor to Cosmic-Ray, a mutation testing framework for Python and involved in several Django projects:\r\n\r\n* [Kiwi TCMS](http://kiwitcms.org) - project lead;\r\n* [django-s3-cache](https://github.com/atodorov/django-s3-cache) - author\r\n* [django-chartit](https://github.com/chartit/django-chartit/) - current maintainer\r\n* [pylint-django](https://github.com/PyCQA/pylint-django) - co-maintainer\r\n* [pylint](https://github.com/PyCQA/pylint) - contributor\r\n* [django-tinymce](https://github.com/aljosa/django-tinymce) - contributor\r\n* [pylint-django](https://github.com/PyCQA/pylint-django) - co-maintainer\r\n\r\nAlex is also very active in various communities in Bulgaria, teaching students and mentoring young engineers! He is also a frequent public speaker on various topics related to software testing and open source. You can find more about him at [atodorov.org](http://atodorov.org)!",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 47,
                "guid": "e45cec8d-ba33-5943-a4d4-3182c39bb917",
                "logo": null,
                "date": "2018-05-26T14:45:00+02:00",
                "start": "14:45",
                "duration": "02:00",
                "room": "🏰",
                "slug": "37A8EC",
                "url": "https://2018.djangocontent.eu/hd/talk/37A8EC",
                "title": "Behind the curtain - How Django handles a request",
                "subtitle": "",
                "track": null,
                "type": "Workshop",
                "language": "en",
                "abstract": "Does Django sometimes feel like Magic to you? In this tutorial, we will peek behind the curtain to understand the wizardry that turns an HTTP request into a response.",
                "description": "Despite rumors to the contrary, Django does not actually involve any magic - it's just code! We will dive deep into this code and trace the exact steps that turn an HTTP request into a response.\r\n\r\nOn this exciting journey, you'll get a high-level overview of the different components that make up Django, dissect elegant code constructs and even see metaclasses in the wild.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 36,
                    "name": "Daniel Hepper",
                    "biography": "Daniel Hepper is an independent software developer, consultant, and trainer with a focus on web development with Python and Django.  He has a degree in Computer Science from the University of Karlsruhe and has been writing software professionally for over 15 years. His clients range from self-funded startups to international corporations. He enjoys sharing his experiences and helping developers level up their software development skills.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        },
        {
          "index": 5,
          "date": "2018-05-27",
          "day_start": "2018-05-27T00:00:00+02:00",
          "day_end": "2018-05-28T00:00:00+02:00",
          "rooms": {
            "🏰": [
              {
                "id": 109,
                "guid": "c6da4e7c-ca5b-5130-b11a-89c92c6a6418",
                "logo": null,
                "date": "2018-05-27T10:30:00+02:00",
                "start": "10:30",
                "duration": "02:00",
                "room": "🏰",
                "slug": "MCPFJE",
                "url": "https://2018.djangocontent.eu/hd/talk/MCPFJE",
                "title": "Hit the ground running with your Django REST Framework API",
                "subtitle": "",
                "track": null,
                "type": "Workshop",
                "language": "en",
                "abstract": "Creating an API for a working e-commerce in 90 minutes? That sounds ambitious!\r\n\r\nJoin this workshop and let's do it together!",
                "description": "A workshop to get you started building API's with Django, Django REST Framework and DRF-Schema-Adapter.\r\n\r\nBasic knowledge of Django models is required but knowledge of Django REST framework is *not* required to attend.\r\n\r\nDuring this workshop, we will build together an API to handle products, customers and orders.\r\n\r\nThe topics covered will include:\r\n\r\n- Basic CRUD\r\n- Ordering, searching & filtering\r\n- Pagination\r\n- Basic workflows (like order confirmation or marking an order as shipped)\r\n- Basic permissions",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 81,
                    "name": "Emmanuelle Delescolle",
                    "biography": "Long-time pythonista, Django fan, co-maintainer and co-author of DRF-Schema-Adapter.\r\n\r\nI am from Belgium and have been involved in open-source at different levels for a bit more than a decade now.\r\n\r\nOne of the things I enjoy the most is sharing knowledge with others. And this is why I enjoy writing tutorials as well as giving talks and workshops.",
                    "answers": []
                  },
                  {
                    "id": 83,
                    "name": "Leila Verhaegen",
                    "biography": "I'm a young junior developper who particulary love Django and EmberJS for writing my code.\r\nI also am co-founder of LevIT a small company in Belgium.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        }
      ]
    }
  }
}